# 학번 2019023390
# 이름 김현준


####################################################################################

number = input('주민번호를 입력하시오:')

num = number[7]
if num == '1':
    gen = '남자'
    year = '19'+number[0:2]
elif num == '3':
    gen = '남자'
    year = '20' + number[0:2]
elif num == '2':
    gen = '여자'
    year = '19' + number[0:2]
else:
    gen = '여자'
    year = '20' + num[0:2]

print('나는 %s년 %s월 %s일에 태어난 %s입니다.'%(year,number[2:4],number[4:6],gen))

####################################################################################